In [18]:
import sqlite3
import pandas as pd
import pandasql as ps

In [29]:
follows_df = pd.read_csv('../raw_data/follows.csv')
follows_df

    user_id  follows        date
0         1        2  1993-09-01
1         2        1  1989-01-01
2         3        1  1993-07-01
3         2        3  1994-10-10
4         3        2  1995-03-01
5         4        2  1988-08-08
6         4        1  1988-08-08
7         1        4  1994-04-02
8         1        5  2000-01-01
9         5        1  2000-01-02
10        5        6  1986-01-10
11        7        1  1990-02-02
12        1        7  1996-10-01
13        1        8  1993-09-03
14        8        1  1995-09-01
15        8        9  1995-09-01
16        9        8  1996-01-10
17        7        8  1993-09-01
18        3        9  1996-05-30
19        4        9  1996-05-30

In [25]:
users_df = pd.read_csv('../raw_data/users.csv')
users_df

   user_id first_name last_name       house
0        1      Harry    Potter  Gryffindor
1        2        Ron    Wesley  Gryffindor
2        3   Hermonie   Granger  Gryffindor
3        4      Ginny   Weasley  Gryffindor
4        5      Draco    Malfoy   Slytherin
5        6        Tom    Riddle   Slytherin
6        7       Luna  Lovegood   Ravenclaw
7        8        Cho     Chang   Ravenclaw
8        9     Cedric   Diggory  Hufflepuff

# How many users in each house?

In [28]:
ps.sqldf("SELECT count(user_id),house FROM users_df GROUP BY house",locals())

   count(user_id)       house
0               4  Gryffindor
1               1  Hufflepuff
2               2   Ravenclaw
3               2   Slytherin

# List all following links that were created before September 1st, 1993

In [70]:
ps.sqldf("SELECT * FROM follows_df Where date <= '1993-09-01' Group by user_id+follows HAVING COUNT(user_id+follows) > 1",locals())

   user_id  follows        date
0        1        2  1993-09-01